HirokiIshiguro/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_flash_rx/src/r_flash_group.c
#if (FLASH_HAS_FCU)
    uint32_t *pFlashClkHz = pcfg, speed_mhz;
#endif
    flash_err_t err = FLASH_SUCCESS;


    if (FLASH_CMD_RESET == cmd)
    {
#if ((FLASH_TYPE == 1) && ((FLASH_CFG_CODE_FLASH_BGO == 1) || (FLASH_CFG_DATA_FLASH_BGO == 1)))
        /* cannot do reset if command in progress */
        if ((FLASH_ERASING == g_flash_state) || (FLASH_BLANKCHECK == g_flash_state))
        {
            flash_stop();   // can abort an outstanding erase or blankcheck command
        }

        while (FLASH_READY != g_flash_state)
            ;
#endif
        flash_reset();
        flash_release_state();
        return err;
    }

    /* Normally return BUSY when not in READY state. But allow for exceptions. */
    if (FLASH_INITIALIZATION == g_flash_state)
    {
        if (FLASH_CMD_CONFIG_CLOCK != cmd)      // allow clock config during Open()
        {
            return FLASH_ERR_BUSY;
        }
    }
    else if ((FLASH_READY != g_flash_state) && (FLASH_CMD_STATUS_GET != cmd))
    {
        return FLASH_ERR_BUSY;      // allow get status any time
    }

    /* Process commands */

    if (FLASH_CMD_STATUS_GET == cmd)
    {
        /* GET OPERATION COMPLETE STATUS */
        err = flash_get_status();
    }

#if ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1)) || (FLASH_CFG_DATA_FLASH_BGO == 1)
    else if (FLASH_CMD_SET_BGO_CALLBACK == cmd)
    {
        /* SET USER CALLBACK FUNCTION */
        FLASH_RETURN_IF_PCFG_NULL;
        err = flash_interrupt_config (true, pcfg);
    }
#endif // ((FLASH_CFG_CODE_FLASH_ENABLE == 1) && (FLASH_CFG_CODE_FLASH_BGO == 1)) || (FLASH_CFG_DATA_FLASH_BGO == 1)

#if (FLASH_CFG_CODE_FLASH_ENABLE == 1)

#if (FLASH_HAS_ROM_CACHE == 1)
    else if (FLASH_CMD_ROM_CACHE_ENABLE == cmd)
    {
        FLASH.ROMCIV.BIT.ROMCIV = 1;                // start invalidation
        while (0 != FLASH.ROMCIV.BIT.ROMCIV)        // wait for invalidation to complete
        {
            R_BSP_NOP();
        }
        FLASH.ROMCE.BIT.ROMCEN = 1;                 // enable cache
        if (1 != FLASH.ROMCE.BIT.ROMCEN)
        {
            err = FLASH_ERR_FAILURE;
        }
    }
    else if (FLASH_CMD_ROM_CACHE_DISABLE == cmd)
    {
        FLASH.ROMCE.BIT.ROMCEN = 0;                 // disable cache
    }
    else if (FLASH_CMD_ROM_CACHE_STATUS == cmd)
    {
        *pCacheStatus = FLASH.ROMCE.BIT.ROMCEN;     // enabled/disabled state
    }
#endif // (FLASH_HAS_ROM_CACHE == 1)

#if (FLASH_HAS_NON_CACHED_RANGES == 1)
    else if (FLASH_CMD_SET_NON_CACHED_RANGE0 == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        err = set_non_cached_regs(pNonCached, (flash_non_cached_regs_t *)&FLASH.NCRG0);
    }
    else if (FLASH_CMD_SET_NON_CACHED_RANGE1 == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        err = set_non_cached_regs(pNonCached, (flash_non_cached_regs_t *)&FLASH.NCRG1);
    }
    else if (FLASH_CMD_GET_NON_CACHED_RANGE0 == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        pNonCached->start_addr = FLASH.NCRG0;
        size_reg_value = (uint32_t)FLASH.NCRC0.BIT.NCSZ + 1;
        pNonCached->size = (flash_non_cached_size_t) (size_reg_value << 4);
        pNonCached->type_mask = FLASH.NCRC0.LONG & FLASH_NON_CACHED_MASK;
    }
    else if (FLASH_CMD_GET_NON_CACHED_RANGE1 == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        pNonCached->start_addr = FLASH.NCRG1;
        size_reg_value = (uint32_t)FLASH.NCRC1.BIT.NCSZ + 1;
        pNonCached->size = (flash_non_cached_size_t) (size_reg_value << 4);
        pNonCached->type_mask = FLASH.NCRC1.LONG & FLASH_NON_CACHED_MASK;
    }
#endif // (FLASH_HAS_NON_CACHED_RANGES == 1)

#if (FLASH_HAS_BOOT_SWAP == 1)
#if (FLASH_IN_DUAL_BANK_MODE == 0)
    else if (FLASH_CMD_SWAPSTATE_GET == cmd)
    {
        /* GET CURRENT STARTUP AREA (NOT NECESSARILY PRESERVED THROUGH RESET */
        FLASH_RETURN_IF_PCFG_NULL;
        FLASH_RETURN_IF_ROM_LT_32K;
        *pSwapInfo = R_CF_GetCurrentSwapState();
    }
    else if (FLASH_CMD_SWAPSTATE_SET == cmd)
    {
        /* SET CURRENT STARTUP AREA (NOT NECESSARILY PRESERVED THROUGH RESET */
        FLASH_RETURN_IF_PCFG_NULL;
        FLASH_RETURN_IF_ROM_LT_32K;
        FLASH_RETURN_IF_BAD_SAS;
        R_CF_SetCurrentSwapState(*pSwapInfo);
    }
#endif // (FLASH_IN_DUAL_BANK_MODE == 0)
    else if (FLASH_CMD_SWAPFLAG_GET == cmd)
    {
        /* GET CURRENT STARTUP AREA EFFECTIVE AT RESET */
        FLASH_RETURN_IF_PCFG_NULL;
        FLASH_RETURN_IF_ROM_LT_32K;
        *pSwapInfo = R_CF_GetCurrentStartupArea();
    }
    else if (FLASH_CMD_SWAPFLAG_TOGGLE == cmd)
    {
        /* TOGGLE CURRENT STARTUP AREA EFFECTIVE AT RESET */
        FLASH_RETURN_IF_BGO_AND_NO_CALLBACK;
        FLASH_RETURN_IF_ROM_LT_32K;
        /* Lock the driver */
        if (FLASH_SUCCESS != flash_lock_state(FLASH_WRITING))       // TODO: ACCESS STATE?
        {
            return FLASH_ERR_BUSY;
        }
        err = R_CF_ToggleStartupArea();
#if (FLASH_CFG_CODE_FLASH_BGO == 0)
        flash_release_state();              // Unlock driver
#endif // (FLASH_CFG_CODE_FLASH_BGO == 0)
    }
#endif // (FLASH_HAS_BOOT_SWAP == 1)

#if (FLASH_HAS_CF_ACCESS_WINDOW == 1)
    else if (FLASH_CMD_ACCESSWINDOW_GET == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        err = R_CF_GetAccessWindow(pAccessInfo);
    }
    else if (FLASH_CMD_ACCESSWINDOW_SET == cmd)
    {
        FLASH_RETURN_IF_PCFG_NULL;
        FLASH_RETURN_IF_BGO_AND_NO_CALLBACK;
#if (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
        /* When providing block numbers, the start address is the larger block number (lower address)
         *   access_info.start_addr =  (uint32_t)FLASH_CF_BLOCK_3;     // ie. This will allow writing block 3
         *   access_info.end_addr =  (uint32_t)(FLASH_CF_BLOCK_2);
         *   access_info.start_addr =  (uint32_t)FLASH_CF_BLOCK_8;     // ie. This will allow writing blocks 3 - 8
         *   access_info.end_addr =  (uint32_t)(FLASH_CF_BLOCK_2);
         */
        if ((pAccessInfo->start_addr > pAccessInfo->end_addr)
         || ((uint32_t)FLASH_CF_LOWEST_VALID_BLOCK > pAccessInfo->start_addr)
         || (0 != (ACCESS_BAD_ADDR_MASK & pAccessInfo->start_addr))
         || ((0 != (ACCESS_BAD_ADDR_MASK & pAccessInfo->end_addr)) && ((uint32_t)FLASH_CF_BLOCK_END != pAccessInfo->end_addr)))
        {
            return(FLASH_ERR_ACCESSW);
        }
#endif // (FLASH_CFG_PARAM_CHECKING_ENABLE == 1)
        /* Lock the driver */
        if (FLASH_SUCCESS != flash_lock_state(FLASH_WRITING))       // TODO: ACCESS STATE?
        {
            return FLASH_ERR_BUSY;
        }
        err = R_CF_SetAccessWindow(pAccessInfo);
#if (FLASH_CFG_CODE_FLASH_BGO == 0)
        flash_release_state();              // Unlock the driver
#endif // (FLASH_CFG_CODE_FLASH_BGO == 0)
    }
#endif // (FLASH_HAS_CF_ACCESS_WINDOW == 1)

